<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Case Study 1</h1>

In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/case_study_1

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Here i have 7 Tables<br>

</div>

In [2]:
%sql SHOW TABLES

 * mysql+pymysql://root:***@localhost:3307/case_study_1
7 rows affected.

[('delivery_partner',),
 ('food',),
 ('menu',),
 ('order_details',),
 ('orders',),
 ('restaurants',),
 ('users',)]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
delivery_partner Table<br>
</div>

In [3]:
%sql SELECT * FROM delivery_partner LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(1, 'Suresh'), (2, 'Amit')]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
food Table<br>
</div>

In [4]:
%sql SELECT * FROM food LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(1, 'Non-veg Pizza', 'Non-veg'), (2, 'Veg Pizza', 'Veg')]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
menu Table<br>
</div>

In [5]:
%sql SELECT * FROM menu LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(1, 1, 1, 450), (2, 1, 2, 400)]


<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
order_details Table<br>
</div>

In [6]:
%sql SELECT * FROM order_details LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(1, 1001, 1), (2, 1001, 3)]



<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
orders Table<br>
</div>

In [7]:
%sql SELECT * FROM orders LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0),
 (1002, 1, 2, 415, datetime.datetime(2022, 5, 26, 0, 0), 1, 19, 5, 2.0)]




<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
restaurants Table<br>
</div>

In [8]:
%sql SELECT * FROM restaurants LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(1, 'dominos', 'Italian'), (2, 'kfc', 'American')]





<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
users Table<br>
</div>

In [9]:
%sql SELECT * FROM users LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h'),
 (2, 'Khushboo', 'khushboo@gmail.com', 'hxn9b')]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
show no of rows<br>
</div>

In [10]:
%sql SELECT COUNT(*) AS 'delivery_partner' FROM delivery_partner;

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(5,)]

In [11]:
%sql SELECT COUNT(*) AS 'food' FROM delivery_partner;

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(5,)]

In [12]:
%sql SELECT COUNT(*) AS 'menu' FROM menu;

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(15,)]

In [13]:
%sql SELECT COUNT(*) AS 'order_details' FROM order_details;

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(50,)]

In [14]:
%sql SELECT COUNT(*) AS 'orders' FROM orders;

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(25,)]

In [15]:
%sql SELECT COUNT(*) AS 'restaurants' FROM restaurants;

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(5,)]

In [16]:
%sql SELECT COUNT(*) AS 'users' FROM users;

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(7,)]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
return random 5 record for users same as in pandas sample <br>
</div>

In [17]:
%sql SELECT * FROM users; 
#without random

 * mysql+pymysql://root:***@localhost:3307/case_study_1
7 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h'),
 (2, 'Khushboo', 'khushboo@gmail.com', 'hxn9b'),
 (3, 'Vartika', 'vartika@gmail.com', '9hu7j'),
 (4, 'Ankit', 'ankit@gmail.com', 'lkko3'),
 (5, 'Neha', 'neha@gmail.com', '3i7qm'),
 (6, 'Anupama', 'anupama@gmail.com', '46rdw2'),
 (7, 'Rishabh', 'rishabh@gmail.com', '4sw123')]

In [18]:
%%sql 
SELECT * FROM users
ORDER BY rand()
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/case_study_1
5 rows affected.

[(7, 'Rishabh', 'rishabh@gmail.com', '4sw123'),
 (3, 'Vartika', 'vartika@gmail.com', '9hu7j'),
 (4, 'Ankit', 'ankit@gmail.com', 'lkko3'),
 (1, 'Nitish', 'nitish@gmail.com', 'p252h'),
 (2, 'Khushboo', 'khushboo@gmail.com', 'hxn9b')]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find Null values data restaurant_rating in orders table<br>
</div>

In [19]:
%%sql 
SELECT * FROM orders
WHERE restaurant_rating IS NULL

 * mysql+pymysql://root:***@localhost:3307/case_study_1
8 rows affected.

[(1003, 1, 3, 240, datetime.datetime(2022, 6, 15, 0, 0), 5, 29, 4, None),
 (1006, 2, 1, 950, datetime.datetime(2022, 6, 10, 0, 0), 2, 16, 5, None),
 (1009, 2, 4, 300, datetime.datetime(2022, 7, 17, 0, 0), 4, 41, 1, None),
 (1013, 3, 2, 230, datetime.datetime(2022, 5, 30, 0, 0), 4, 45, 3, None),
 (1015, 3, 2, 230, datetime.datetime(2022, 6, 22, 0, 0), 3, 21, 5, None),
 (1017, 4, 4, 300, datetime.datetime(2022, 5, 30, 0, 0), 1, 50, 1, None),
 (1021, 5, 1, 550, datetime.datetime(2022, 7, 1, 0, 0), 5, 22, 2, None),
 (1025, 5, 2, 645, datetime.datetime(2022, 7, 28, 0, 0), 2, 44, 4, None)]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find Not Null values data restaurant_rating in orders table<br>
</div>

In [20]:
%%sql 
SELECT * FROM orders
WHERE restaurant_rating IS NOT NULL

 * mysql+pymysql://root:***@localhost:3307/case_study_1
17 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0),
 (1002, 1, 2, 415, datetime.datetime(2022, 5, 26, 0, 0), 1, 19, 5, 2.0),
 (1004, 1, 3, 240, datetime.datetime(2022, 6, 29, 0, 0), 4, 42, 3, 5.0),
 (1005, 1, 3, 220, datetime.datetime(2022, 7, 10, 0, 0), 1, 58, 1, 4.0),
 (1007, 2, 2, 530, datetime.datetime(2022, 6, 23, 0, 0), 3, 60, 1, 5.0),
 (1008, 2, 3, 240, datetime.datetime(2022, 7, 7, 0, 0), 5, 33, 4, 5.0),
 (1010, 2, 5, 650, datetime.datetime(2022, 7, 31, 0, 0), 1, 67, 1, 4.0),
 (1011, 3, 1, 450, datetime.datetime(2022, 5, 10, 0, 0), 2, 25, 3, 1.0),
 (1012, 3, 4, 180, datetime.datetime(2022, 5, 20, 0, 0), 5, 33, 4, 1.0),
 (1014, 3, 2, 230, datetime.datetime(2022, 6, 11, 0, 0), 2, 55, 1, 2.0),
 (1016, 4, 4, 300, datetime.datetime(2022, 5, 15, 0, 0), 3, 31, 5, 5.0),
 (1018, 4, 4, 400, datetime.datetime(2022, 6, 15, 0, 0), 2, 40, 3, 5.0),
 (1019, 4, 5, 400, datetime.datetime(2022, 6, 30, 0, 0), 1, 70, 2, 4.0),
 (1020, 4, 5, 400, datetime.datetime(2022, 7, 15, 0, 0), 3, 26, 5, 3.0),
 (1022, 5, 1, 550, datetime.datetime(2022, 7, 8, 0, 0), 1, 34, 5, 1.0),
 (1023, 5, 2, 645, datetime.datetime(2022, 7, 15, 0, 0), 4, 38, 5, 1.0),
 (1024, 5, 2, 645, datetime.datetime(2022, 7, 21, 0, 0), 2, 58, 2, 1.0)]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find the numbers of orders placed by each customer<br>
</div>

In [21]:
%%sql 
SELECT 
users.name,COUNT(*) AS 'no_of_orders'

FROM orders
INNER JOIN users
ON orders.user_id = users.user_id

GROUP BY orders.user_id

 * mysql+pymysql://root:***@localhost:3307/case_study_1
5 rows affected.

[('Nitish', 5), ('Khushboo', 5), ('Vartika', 5), ('Ankit', 5), ('Neha', 5)]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find restaurant of orders placed<br>
</div>

In [22]:
%sql SELECT * FROM restaurants LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'dominos', 'Italian')]

In [23]:
%sql SELECT * FROM orders LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [24]:
%sql SELECT * FROM users LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h')]

In [25]:
%%sql 
SELECT 
restaurants.r_name,orders.user_id, COUNT(*) AS "no_of_orders"
FROM restaurants
INNER JOIN orders
ON restaurants.r_id = orders.r_id

GROUP BY restaurants.r_id

 * mysql+pymysql://root:***@localhost:3307/case_study_1
5 rows affected.

[('dominos', 1, 5),
 ('kfc', 1, 8),
 ('box8', 1, 4),
 ('Dosa Plaza', 2, 5),
 ('China Town', 2, 3)]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find the no of votes and avg rating for all the restaurants<br>
</div>

In [26]:
%sql SELECT * FROM restaurants LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'dominos', 'Italian')]

In [27]:
%sql SELECT * FROM orders LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [28]:
%%sql 
SELECT 

restaurants.r_name,
COUNT(*) AS 'votes',
ROUND(AVG(orders.restaurant_rating),2) AS 'avg'

FROM restaurants 
INNER JOIN orders
ON restaurants.r_id = orders.r_id

WHERE orders.restaurant_rating IS NOT NULL

GROUP BY orders.r_id

 * mysql+pymysql://root:***@localhost:3307/case_study_1
5 rows affected.

[('dominos', 3, 1.67),
 ('kfc', 5, 2.2),
 ('box8', 3, 4.67),
 ('Dosa Plaza', 3, 3.67),
 ('China Town', 3, 3.67)]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find the food that is being sold at most number of restaurants<br>
</div>

In [29]:
%sql SELECT * FROM menu LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 1, 1, 450)]

In [30]:
%sql SELECT * FROM food LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Non-veg Pizza', 'Non-veg')]

In [31]:
%%sql 
SELECT 
food.f_name,COUNT(*) AS 'no_of_food'
FROM food 

INNER JOIN menu
ON food.f_id = menu.f_id

GROUP BY food.f_name,menu.f_id
ORDER BY `no_of_food` DESC 
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[('Choco Lava cake', 3)]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find the restaurant max Revenue in given month of May<br>
</div>

In [32]:
%sql SELECT * FROM orders LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [33]:
%sql SELECT * FROM restaurants LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'dominos', 'Italian')]

In [34]:
%sql SELECT * FROM restaurants LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'dominos', 'Italian')]

In [36]:
%%sql 
SELECT 
restaurants.r_name,SUM(orders.amount) AS 'revenue'

FROM orders
INNER JOIN restaurants
ON orders.r_id = restaurants.r_id

WHERE MONTHNAME(DATE(orders.date)) = 'May'

GROUP BY restaurants.r_id
ORDER BY orders.amount DESC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[('dominos', Decimal('1000'))]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find the all restaurants Revenue in All months<br>
</div>

In [49]:
%%sql 
SELECT 
restaurants.r_name
,MONTHNAME(DATE(orders.date)) AS "Month",
SUM(orders.amount) AS 'revenue'
FROM orders
INNER JOIN restaurants
ON orders.r_id = restaurants.r_id

GROUP BY restaurants.r_id,Month
ORDER BY revenue DESC

 * mysql+pymysql://root:***@localhost:3307/case_study_1
13 rows affected.

[('kfc', 'July', Decimal('1935')),
 ('dominos', 'July', Decimal('1100')),
 ('China Town', 'July', Decimal('1050')),
 ('dominos', 'May', Decimal('1000')),
 ('kfc', 'June', Decimal('990')),
 ('dominos', 'June', Decimal('950')),
 ('Dosa Plaza', 'May', Decimal('780')),
 ('kfc', 'May', Decimal('645')),
 ('box8', 'June', Decimal('480')),
 ('box8', 'July', Decimal('460')),
 ('Dosa Plaza', 'June', Decimal('400')),
 ('China Town', 'June', Decimal('400')),
 ('Dosa Plaza', 'July', Decimal('300'))]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find the restaurants with sales > 1500<br>
</div>

In [76]:
%%sql
SELECT 

restaurants.r_name,
SUM(amount) AS `revenue` FROM orders

INNER JOIN restaurants
ON orders.r_id = restaurants.r_id

GROUP BY restaurants.r_id HAVING revenue > 1500
ORDER BY `revenue` DESC

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[('kfc', Decimal('3570')), ('dominos', Decimal('3050'))]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find customers who have never ordered<br>
</div>

In [78]:
%sql SELECT * FROM orders LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [82]:
%sql SELECT * FROM users LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h')]

In [285]:
r = %sql SELECT * FROM orders
r.DataFrame().to_clipboard(index=False)

 * mysql+pymysql://root:***@localhost:3307/case_study_1
25 rows affected.

In [280]:
%%sql
SELECT t1.user_id, t1.name FROM users t1

EXCEPT 

SELECT t2.user_id, t3.name FROM orders t2

INNER JOIN users t3
ON t3.user_id = t2.user_id

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(6, 'Anupama'), (7, 'Rishabh')]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Understand the Execution order<br>
</div>

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Step 1<br>
</div>

In [288]:
%%sql
SELECT t1.user_id, t1.name FROM users t1

# F J W G S D O

# 1st users t1 
# 2nd  t1.user_id, t1.name

 * mysql+pymysql://root:***@localhost:3307/case_study_1
7 rows affected.

[(1, 'Nitish'),
 (2, 'Khushboo'),
 (3, 'Vartika'),
 (4, 'Ankit'),
 (5, 'Neha'),
 (6, 'Anupama'),
 (7, 'Rishabh')]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Step 2<br>
</div>

In [292]:
%%sql
SELECT t2.user_id, t3.name FROM orders t2
INNER JOIN users t3 
ON t3.user_id = t2.user_id

# F J W G S D O

# 1st orders t2 
# 2nd JOIN users t3 
# 3rd t2.user_id, t3.name

 * mysql+pymysql://root:***@localhost:3307/case_study_1
25 rows affected.

[(1, 'Nitish'),
 (1, 'Nitish'),
 (1, 'Nitish'),
 (1, 'Nitish'),
 (1, 'Nitish'),
 (2, 'Khushboo'),
 (2, 'Khushboo'),
 (2, 'Khushboo'),
 (2, 'Khushboo'),
 (2, 'Khushboo'),
 (3, 'Vartika'),
 (3, 'Vartika'),
 (3, 'Vartika'),
 (3, 'Vartika'),
 (3, 'Vartika'),
 (4, 'Ankit'),
 (4, 'Ankit'),
 (4, 'Ankit'),
 (4, 'Ankit'),
 (4, 'Ankit'),
 (5, 'Neha'),
 (5, 'Neha'),
 (5, 'Neha'),
 (5, 'Neha'),
 (5, 'Neha')]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Step 3 Use EXCEPT<br>
</div>

In [298]:
%%sql
SELECT t1.user_id, t1.name FROM users t1

EXCEPT

SELECT t2.user_id, t3.name FROM orders t2
INNER JOIN users t3 
ON t3.user_id = t2.user_id

 * mysql+pymysql://root:***@localhost:3307/case_study_1
2 rows affected.

[(6, 'Anupama'), (7, 'Rishabh')]

<div style="text-align:left; color:blue; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">


<h2>FROM Clause:</h2>
<p>Execution Order: 1</p>
<p>FROM users t1</p>

<h2>FROM Clause with JOIN:</h2>
<p>Execution Order: 2</p>
<p>FROM orders t2 INNER JOIN users t3 ON t3.user_id = t2.user_id</p>

<h2>SELECT Clause on Users Table:</h2>
    <p>Execution Order: 4</p>
    <p>SELECT t1.user_id, t1.name FROM users t1</p>

<h2>SELECT Clause on Joined Tables:</h2>
    <p>Execution Order: 5</p>
    <p>SELECT t2.user_id, t3.name FROM orders t2 INNER JOIN users t3 ON t3.user_id = t2.user_id</p>

<h2>EXCEPT Operator:</h2>
    <p>Execution Order: N/A (EXCEPT is a set operation and generally applied last)</p>
    <p>EXCEPT is applied to the results obtained from Steps 4 and 5.</p>
<p>In short, the sequence is as follows:</p>
    <ul>
        <li>FROM</li>
        <li>JOIN</li>
        <li>SELECT on Users Table</li>
        <li>SELECT on Joined Tables</li>
        <li>EXCEPT (applied to the results of Steps 3 and 4)</li>
    </ul>
</div>

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Show order details of a particular customer user_id 1 and in a given date range 2022-05-10 to 2022-06-10 <br>
</div>

In [299]:
%sql SELECT * FROM users LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h')]

In [300]:
%sql SELECT * FROM orders LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [312]:
%sql SELECT * FROM order_details LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 1001, 1)]

In [310]:
%sql SELECT * FROM restaurants LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'dominos', 'Italian')]

In [311]:
%sql SELECT * FROM food LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Non-veg Pizza', 'Non-veg')]

In [332]:
%%sql 
SELECT 
t1.user_id,t1.name,
t2.date,
t5.f_name

FROM users t1

INNER JOIN orders t2
ON t1.user_id = t2.user_id

INNER JOIN order_details t3
ON t2.order_id = t3.order_id

INNER JOIN restaurants t4
ON t2.r_id = t4.r_id

INNER JOIN food t5
ON t3.f_id = t5.f_id

WHERE t1.user_id = 1 AND date BETWEEN "2022-05-10" AND "2022-06-29"

 * mysql+pymysql://root:***@localhost:3307/case_study_1
8 rows affected.

[(1, 'Nitish', datetime.datetime(2022, 5, 10, 0, 0), 'Non-veg Pizza'),
 (1, 'Nitish', datetime.datetime(2022, 5, 10, 0, 0), 'Choco Lava cake'),
 (1, 'Nitish', datetime.datetime(2022, 5, 26, 0, 0), 'Chicken Wings'),
 (1, 'Nitish', datetime.datetime(2022, 5, 26, 0, 0), 'Choco Lava cake'),
 (1, 'Nitish', datetime.datetime(2022, 6, 15, 0, 0), 'Rice Meal'),
 (1, 'Nitish', datetime.datetime(2022, 6, 15, 0, 0), 'Choco Lava cake'),
 (1, 'Nitish', datetime.datetime(2022, 6, 29, 0, 0), 'Rice Meal'),
 (1, 'Nitish', datetime.datetime(2022, 6, 29, 0, 0), 'Choco Lava cake')]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Show the customer favorite food type <br>
</div>

In [414]:
%sql SELECT * FROM food LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Non-veg Pizza', 'Non-veg')]

In [337]:
%sql SELECT * FROM order_details LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 1001, 1)]

In [338]:
%sql SELECT * FROM orders LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [344]:
%sql SELECT * FROM users LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h')]

In [412]:
%%sql

SELECT 
food.f_id,food.type,
orders.order_id,
users.user_id,users.name,
COUNT(*) AS "OrderCount"

FROM food 

INNER JOIN order_details ON food.f_id = order_details.f_id
INNER JOIN orders ON orders.order_id = order_details.order_id
INNER JOIN users ON users.user_id = orders.user_id

GROUP BY users.user_id
ORDER BY OrderCount DESC

 * mysql+pymysql://root:***@localhost:3307/case_study_1
5 rows affected.

[(1, 'Non-veg', 1021, 5, 'Neha', 13),
 (1, 'Non-veg', 1006, 2, 'Khushboo', 12),
 (1, 'Non-veg', 1001, 1, 'Nitish', 10),
 (8, 'Veg', 1016, 4, 'Ankit', 10),
 (1, 'Non-veg', 1011, 3, 'Vartika', 5)]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find most costly restaurants (avg price / dish) <br>
</div>

In [416]:
%sql SELECT * FROM restaurants LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'dominos', 'Italian')]

In [439]:
%sql SELECT * FROM menu LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 1, 1, 450)]

In [470]:
%%sql 

SELECT 
restaurants.r_name,
ROUND(SUM(menu.price)/COUNT(*),2) AS 'avg'
FROM menu
INNER JOIN restaurants ON restaurants.r_id = menu.r_id
GROUP BY restaurants.r_id
ORDER BY avg DESC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[('dominos', Decimal('316.67'))]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find delivery partner compenstion using formula (#delivery * 100 + 1000 * avg_rating)<br>
</div>

In [471]:
%sql SELECT * FROM delivery_partner LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Suresh')]

In [473]:
%sql SELECT * FROM orders LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [489]:
%%sql 

SELECT delivery_partner.partner_name, ROUND(((COUNT(*)*100) + (1000*AVG(orders.delivery_rating))),2) AS 'compenstion'

FROM delivery_partner 
INNER JOIN orders
ON orders.partner_id = delivery_partner.partner_id
GROUP BY orders.partner_id 
ORDER BY 'compenstion' DESC

 * mysql+pymysql://root:***@localhost:3307/case_study_1
5 rows affected.

[('Suresh', Decimal('3557.14')),
 ('Gyandeep', Decimal('3900.00')),
 ('Kartik', Decimal('3400.00')),
 ('Amit', Decimal('3600.00')),
 ('Lokesh', Decimal('4400.00'))]

<div style="text-align:justify; color:green; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Find the min and max and Avg and total amounts for all the customers<br>
</div>

In [509]:
%sql SELECT * FROM orders LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [510]:
%sql SELECT * FROM users LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/case_study_1
1 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h')]

In [517]:
%%sql
SELECT name,MIN(amount),MAX(amount),AVG(amount),SUM(amount) FROM users
INNER JOIN orders
ON orders.user_id = users.user_id
GROUP BY orders.user_id

 * mysql+pymysql://root:***@localhost:3307/case_study_1
5 rows affected.

[('Nitish', 220, 550, Decimal('333.0000'), Decimal('1665')),
 ('Khushboo', 240, 950, Decimal('534.0000'), Decimal('2670')),
 ('Vartika', 180, 450, Decimal('264.0000'), Decimal('1320')),
 ('Ankit', 300, 400, Decimal('360.0000'), Decimal('1800')),
 ('Neha', 550, 645, Decimal('607.0000'), Decimal('3035'))]